# 2. Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

#a = input('Введите элементы списка: ')
my_list = [1, 2, 3, 4, 5]
#for i in my_list:
#print(my_list[2::-1])
print(my_list[:2:])
#print(my_list.index(5))

#print(my_list.reverse())
#my_list.reverse()
#print(my_list)

# не хватило времени вникнуть в срезы которые меняют порядок  - [::-1]

